# Задача 9: Замена элементов по условию
# Замени все числа больше 5 на "большое", остальные на "маленькое"

def replace_elements():
    numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    sorted_words = []
    for s_w in numbers:
        if s_w > 5:
            sorted_words.append("большое")
        else:
            sorted_words.append("маленькое")
    print(sorted_words)
    # Ожидаемый результат: ["маленькое", "маленькое", "маленькое", "маленькое", "маленькое", "большое", "большое", "большое", "большое", "большое"]


replace_elements()